In [1]:
import pandas as pd

### Data loading
> xlrd 모듈 설치

In [3]:
!conda install --y xlrd

Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working... done

# All requested packages already installed.

==> WARNING: A newer version of conda exists. <==
  current version: 4.10.3
  latest version: 4.11.0

Please update conda by running

    $ conda update -n base -c defaults conda

In [4]:
import numpy as np

In [8]:
df = pd.DataFrame(np.arange(16).reshape((4,4)))
df.columns = list("abcd")

In [9]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [10]:
s = pd.Series(np.arange(10,14))
s

0    10
1    11
2    12
3    13
dtype: int32

In [15]:
# 행 기준 더하기 -> df 0행 + s 이런식
df.add(s,axis = 0)

    a   b   c   d
0  10  11  12  13
1  15  16  17  18
2  20  21  22  23
3  25  26  27  28

### lambda ,map

In [16]:
s1 = pd.Series(np.arange(10))
s1.head()

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [17]:
s1.map(lambda x:x**2).head()

0     0
1     1
2     4
3     9
4    16
dtype: int64

In [25]:
!pip install wget

Collecting wget
  Downloading wget-3.2.zip (10 kB)
Building wheels for collected packages: wget
  Building wheel for wget (setup.py): started
  Building wheel for wget (setup.py): finished with status 'done'
  Created wheel for wget: filename=wget-3.2-py3-none-any.whl size=9672 sha256=cbb1a6716ca58932a98bd114a07be8e18a7b025c2b1e65254fe71c2491920750
  Stored in directory: c:\users\sm970\appdata\local\pip\cache\wheels\04\5f\3e\46cc37c5d698415694d83f607f833f83f0149e49b3af9d0f38
Successfully built wget
Installing collected packages: wget
Successfully installed wget-3.2

In [31]:
import wget

In [33]:
wget.download("https://raw.githubusercontent.com/rstudio/Intro/master/data/wages.csv")

100% [..............................................................................] 62250 / 62250

'wages.csv'

In [44]:
df = pd.read_csv('wages.csv')

In [45]:
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [47]:
df.sex.unique()

array(['male', 'female'], dtype=object)

In [52]:
df['sex_code'] = df.sex.map(lambda x:0 if x=='male' else 1)
df.tail()

              earn  height     sex   race  ed  age  sex_code
1374  30173.380363   71.68    male  white  12   33         0
1375  24853.519514   61.31  female  white  18   86         1
1376  13710.671312   63.64  female  white  12   37         1
1377  95426.014410   71.65    male  white  12   54         0
1378   9575.461857   68.22    male  white  12   31         0

### apply

In [53]:
df_info = df[['earn','height','age']]
df_info.head()

           earn  height  age
0  79571.299011   73.89   49
1  96396.988643   66.23   62
2  48710.666947   63.77   33
3  80478.096153   63.22   95
4  82089.345498   63.08   43

In [56]:
# 각 column 별로 결과값 반환
f = lambda x:x.max()-x.min()
df_info.apply(f)

earn      318047.708444
height        19.870000
age           73.000000
dtype: float64

In [57]:
df_info.sum()

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

In [59]:
# series 값 반환
def f(x):
    return pd.Series([x.min(),x.max()],index = ['min','max'])
df_info.apply(f)

              earn  height  age
min     -98.580489   57.34   22
max  317949.127955   77.21   95

In [61]:
# element 단위로 함수 적용할 때 -> applymap 사용
df_info.applymap(lambda x:-x)

              earn  height  age
0    -79571.299011  -73.89  -49
1    -96396.988643  -66.23  -62
2    -48710.666947  -63.77  -33
3    -80478.096153  -63.22  -95
4    -82089.345498  -63.08  -43
...            ...     ...  ...
1374 -30173.380363  -71.68  -33
1375 -24853.519514  -61.31  -86
1376 -13710.671312  -63.64  -37
1377 -95426.014410  -71.65  -54
1378  -9575.461857  -68.22  -31

[1379 rows x 3 columns]

# pandas built-in function

## describe()

In [70]:
df = pd.read_csv('wages.csv')

In [71]:
df.describe()

                earn       height           ed          age
count    1379.000000  1379.000000  1379.000000  1379.000000
mean    32446.292622    66.592640    13.354605    45.328499
std     31257.070006     3.818108     2.438741    15.789715
min       -98.580489    57.340000     3.000000    22.000000
25%     10538.790721    63.720000    12.000000    33.000000
50%     26877.870178    66.050000    13.000000    42.000000
75%     44506.215336    69.315000    15.000000    55.000000
max    317949.127955    77.210000    18.000000    95.000000

## sort_values()

In [73]:
df.sort_values(['age','earn'],ascending=True).head(10).reset_index(drop=True)

          earn  height     sex      race  ed  age
0   -56.321979   67.81    male  hispanic  10   22
1   -27.876819   72.29    male     white  12   22
2   -25.655260   68.90    male     white  12   22
3   988.565070   64.71  female     white  12   22
4  1000.221504   64.09  female     white  12   22
5  1002.023843   66.59  female     white  12   22
6  1007.994941   68.26  female     white  12   22
7  1578.542814   64.53    male     white  12   22
8  1955.168187   69.87  female     black  12   22
9  2581.870402   64.79  female     white  12   22

## corr,cov,corrwith

In [74]:
# age와 earn의 상관계수
df.age.corr(df.earn)

0.07400349177836056

In [75]:
# age와 earn의 공분산
df.age.cov(df.earn)

36523.69921040891

In [76]:
# earn과 전체 데이터의 상관계수
df.corrwith(df.earn)

earn      1.000000
height    0.291600
ed        0.350374
age       0.074003
dtype: float64

In [77]:
# 모든 계수들간의 상관계수
df.corr()

            earn    height        ed       age
earn    1.000000  0.291600  0.350374  0.074003
height  0.291600  1.000000  0.114047 -0.133727
ed      0.350374  0.114047  1.000000 -0.129802
age     0.074003 -0.133727 -0.129802  1.000000

In [81]:
df.race.value_counts()

white       1147
black        126
hispanic      77
other         29
Name: race, dtype: int64

In [82]:
df

              earn  height     sex   race  ed  age
0     79571.299011   73.89    male  white  16   49
1     96396.988643   66.23  female  white  16   62
2     48710.666947   63.77  female  white  16   33
3     80478.096153   63.22  female  other  16   95
4     82089.345498   63.08  female  white  17   43
...            ...     ...     ...    ...  ..  ...
1374  30173.380363   71.68    male  white  12   33
1375  24853.519514   61.31  female  white  18   86
1376  13710.671312   63.64  female  white  12   37
1377  95426.014410   71.65    male  white  12   54
1378   9575.461857   68.22    male  white  12   31

[1379 rows x 6 columns]

## groupby()

In [90]:
h_index = df.groupby(['race','sex'])['earn'].sum()
pd.DataFrame(h_index)

                         earn
race     sex
black    female  2.113063e+06
         male    1.461821e+06
hispanic female  9.759982e+05
         male    9.863701e+05
other    female  6.149582e+05
         male    3.210868e+05
white    female  1.712299e+07
         male    2.114715e+07

In [91]:
h_index.index

MultiIndex([(   'black', 'female'),
            (   'black',   'male'),
            ('hispanic', 'female'),
            ('hispanic',   'male'),
            (   'other', 'female'),
            (   'other',   'male'),
            (   'white', 'female'),
            (   'white',   'male')],
           names=['race', 'sex'])

In [92]:
# 해당 데이터를 unstack을 사용하여 matrix로 변환
h_index.unstack()

sex             female          male
race
black     2.113063e+06  1.461821e+06
hispanic  9.759982e+05  9.863701e+05
other     6.149582e+05  3.210868e+05
white     1.712299e+07  2.114715e+07

In [93]:
h_index.reset_index()

       race     sex          earn
0     black  female  2.113063e+06
1     black    male  1.461821e+06
2  hispanic  female  9.759982e+05
3  hispanic    male  9.863701e+05
4     other  female  6.149582e+05
5     other    male  3.210868e+05
6     white  female  1.712299e+07
7     white    male  2.114715e+07

In [94]:
# 인덱스의 레벨 변경
h_index.swaplevel()

sex     race
female  black       2.113063e+06
male    black       1.461821e+06
female  hispanic    9.759982e+05
male    hispanic    9.863701e+05
female  other       6.149582e+05
male    other       3.210868e+05
female  white       1.712299e+07
male    white       2.114715e+07
Name: earn, dtype: float64

In [97]:
h_index.sort_index(level=0)

race      sex
black     female    2.113063e+06
          male      1.461821e+06
hispanic  female    9.759982e+05
          male      9.863701e+05
other     female    6.149582e+05
          male      3.210868e+05
white     female    1.712299e+07
          male      2.114715e+07
Name: earn, dtype: float64

In [100]:
h_index.sum(level=0)

C:\Users\sm970\AppData\Local\Temp/ipykernel_1776/1316823663.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  h_index.sum(level=0)

race
black       3.574884e+06
hispanic    1.962368e+06
other       9.360450e+05
white       3.827014e+07
Name: earn, dtype: float64

## grouped 를 사용하여 데이터 분할

In [105]:
grouped = df.groupby("race")
for name,group in grouped:
    print(name)
    print(group)

black
              earn  height     sex   race  ed  age
21    12131.822115   64.20  female  black  12   59
22    84223.397919   72.76    male  black  13   39
28    16896.100044   62.76  female  black  12   39
42    48693.479796   67.19  female  black  14   35
55    20594.711211   66.35    male  black   8   60
...            ...     ...     ...    ...  ..  ...
1288  31868.479340   71.49    male  black  12   30
1295  24857.441360   67.82  female  black  11   35
1356   6354.842127   70.09    male  black  14   25
1363  19182.607431   73.26    male  black  13   25
1366  24849.193294   60.30  female  black  12   80

[126 rows x 6 columns]
hispanic
              earn  height     sex      race  ed  age
8      3212.649556   72.24    male  hispanic  15   25
51    18497.853893   60.61  female  hispanic  12   25
70    25550.755908   62.04    male  hispanic  14   32
86     4812.715281   67.12  female  hispanic   8   43
87    47742.125275   68.19    male  hispanic  12   36
...            ...     ...     ...       ...  ..  ...
1329  27044.398985   70.96    male  hispanic  13   40
1333  58234.580965   63.60  female  hispanic  17   38
1334  15865.726828   71.90    male  hispanic  13   24
1368   4184.222685   60.19  female  hispanic   6   71
1369   4755.736508   72.94    male  hispanic  15   24

[77 rows x 6 columns]
other
               earn  height     sex   race  ed  age
3      80478.096153   63.22  female  other  16   95
119      996.182111   66.31  female  other  16   36
157    34383.704520   68.07  female  other  12   54
223    31727.703585   66.64    male  other  10   32
230    51892.942388   65.68  female  other  18   39
260    13718.454392   64.51  female  other  10   86
295     5764.826401   66.36  female  other  12   39
339    10565.080348   62.79  female  other  12   35
524    64598.456297   59.72  female  other  18   39
594    23877.347633   65.08    male  other  14   25
625    24855.035494   61.20  female  other  16   38
662    44600.177062   66.41    male  other  15   44
708     1023.988921   62.99  female  other   8   56
764    60492.121231   67.04    male  other  17   58
791      987.960797   61.66  female  other  17   30
879    44447.409957   74.83    male  other  16   38
972    35979.200227   62.73  female  other  18   63
993    32809.632677   59.61  female  other  16   92
998    24854.104206   64.02  female  other  13   37
1015    8026.645794   62.04  female  other   6   76
1153    7364.532140   64.81  female  other  12   32
1156   27130.701913   69.07    male  other  14   37
1236     -49.597624   70.96    male  other  12   24
1243   28575.385564   62.05    male  other  16   31
1277   12721.568402   65.93    male  other  10   64
1279   39687.720336   61.89    male  other  14   41
1298    7876.230872   69.78    male  other  13   26
1367   40757.935077   64.17  female  other  16   41
1370  175901.453598   65.90  female  other  18   52
white
              earn  height     sex   race  ed  age
0     79571.299011   73.89    male  white  16   49
1     96396.988643   66.23  female  white  16   62
2     48710.666947   63.77  female  white  16   33
4     82089.345498   63.08  female  white  17   43
5     15313.352901   64.53  female  white  15   30
...            ...     ...     ...    ...  ..  ...
1374  30173.380363   71.68    male  white  12   33
1375  24853.519514   61.31  female  white  18   86
1376  13710.671312   63.64  female  white  12   37
1377  95426.014410   71.65    male  white  12   54
1378   9575.461857   68.22    male  white  12   31

[1147 rows x 6 columns]

In [107]:
grouped.get_group("black")

              earn  height     sex   race  ed  age
21    12131.822115   64.20  female  black  12   59
22    84223.397919   72.76    male  black  13   39
28    16896.100044   62.76  female  black  12   39
42    48693.479796   67.19  female  black  14   35
55    20594.711211   66.35    male  black   8   60
...            ...     ...     ...    ...  ..  ...
1288  31868.479340   71.49    male  black  12   30
1295  24857.441360   67.82  female  black  11   35
1356   6354.842127   70.09    male  black  14   25
1363  19182.607431   73.26    male  black  13   25
1366  24849.193294   60.30  female  black  12   80

[126 rows x 6 columns]

In [111]:
grouped.agg(np.mean)

                  earn     height         ed        age
race
black     28372.093597  66.528492  13.039683  43.650794
hispanic  25485.302691  65.555325  12.987013  41.519481
other     32277.413809  65.016207  13.965517  46.896552
white     33365.423212  66.709180  13.398431  45.728858